app/Http/traits/CurrencyTrait.php

    public function displayWithCurrency(int|float $amount) : string
    {
        $generalSetting = GeneralSetting::latest()->first();
---
select * from `general_settings` order by `created_at` desc limit 1