app/Http/traits/PaymentTrait.php

    public function paymentMethods() : array |object|string
    {
        $paymentSetting = PaymentSetting::latest()->first();
---
select * from `payment_settings` order by `created_at` desc limit 1