app/Http/Controllers/Landlord/DashboardController.php

select * from `packages` where `packages`.`id` in (2, 4, 5, 14) and `packages`.`deleted_at` is null
select * from `tenants` where `tenants`.`deleted_at` is null
select sum(`amount`) as aggregate from `payments`
select count(*) as aggregate from `packages` where `packages`.`deleted_at` is null
---
    public function index()
    {
        $autoUpdateData = $this->general();
        $alertVersionUpgradeEnable = $autoUpdateData['alertVersionUpgradeEnable'];
        $alertBugEnable =  null; //$autoUpdateData['alertBugEnable'];

        $tenants = Tenant::with('package')->get();
        $totalTenantCount = $tenants->count();
        $totalActiveTenantCount = Tenant::totalActiveTenantCount();
        $receivedAmount = Payment::sum('amount');
        $totalPackageCount = Package::count();