app/Http/Controllers/Landlord/TenantController.php

    public function datatable()
    {
        $tenants = Tenant::with(['customer','package','domainInfo'])->get();
---
select * from `customers` where `customers`.`id` in (47, 54, 64, 75, 76, 77, 81, 93, 94, 96, 97, 98, 99) and `customers`.`deleted_at` is null
select * from `packages` where `packages`.`id` in (2, 4, 5, 14) and `packages`.`deleted_at` is null
select * from `tenants` where `tenants`.`deleted_at` is null

    public function tenantInfo(Tenant $tenant)
    {
        $tenant->load('customer:id,first_name,last_name,email,username,company_name,contact_no');
---
select `id`, `first_name`, `last_name`, `email`, `username`, `company_name`, `contact_no` from `customers` where `customers`.`id` in (54) and `customers`.`deleted_at` is null