app/Http/View/Composers/LayoutComposer.php

	public function compose(View $view)
	{
        if (in_array(request()->getHost(), config('tenancy.central_domains')))
            $languages = Language::all();
---
select * from `languages` where `languages`.`deleted_at` is null