app/Http/Controllers/DashboardController.php

	public function index()
	{
		$employees = Employee::with('department:id,department_name', 'designation:id,designation_name')
			->select('id', 'department_id', 'designation_id', 'is_active')
			->where('is_active', '=', 1)->where('is_active',1)
            ->where('exit_date',NULL)->get();
---
select `id`, `department_id`, `designation_id`, `is_active` from `employees` where `is_active` = 1 and `is_active` = 1 and `exit_date` is null
select `id`, `department_name` from `departments` where `departments`.`id` in (1)
select `id`, `designation_name` from `designations` where `designations`.`id` in (1)

			}
		}

		$attendance_count = Attendance::where('attendance_date', now()->format('Y-m-d'))->distinct('employee_id')->count();
---
select count(distinct `employee_id`) as aggregate from `attendances` where `attendance_date` = '2024-08-18'

		$leave_count = leave::where('start_date', '<=', now()->format('Y-m-d'))
			->where('end_date', '>=', now()->format('Y-m-d'))->count();

		$total_expense_raw = FinanceExpense::sum('amount');
		$total_deposit_raw = FinanceDeposit::sum('amount');
		$total_salaries_paid = Payslip::sum('net_salary');
---
select sum(`amount`) as aggregate from `finance_expenses`
select sum(`amount`) as aggregate from `finance_deposits`
select sum(`net_salary`) as aggregate from `payslips`

			$months[] = date("F-Y", strtotime(date('Y-m-01') . " -$i months"));
		}

		$payslips = Payslip::all('id', 'net_salary', 'month_year');
---
select `id`, `net_salary`, `month_year` from `payslips`



		$companies = company::select('id', 'company_name')->get();
		$leave_types = LeaveType::select('id', 'leave_type', 'allocated_day')->get();
		$travel_types = TravelType::select('id', 'arrangement_type')->get();
		$training_types = TrainingType::select('id', 'type')->get();
		$trainers = Trainer::select('id', 'first_name', 'last_name')->get();
		// $clients = Client::select('id', 'name')->get();
		$clients = Client::select('id', 'first_name','last_name')->get();

		$projects = Project::select('id', 'title', 'project_status')->get();
---
select `id`, `leave_type`, `allocated_day` from `leave_types`
select `id`, `arrangement_type` from `travel_types`
select `id`, `type` from `training_types`
select `id`, `first_name`, `last_name` from `trainers`
select `id`, `first_name`, `last_name` from `clients`
select `id`, `title`, `project_status` from `projects`


		$completed_projects = $projects->where('project_status', 'completed')->count();

		$announcements = Announcement::where('start_date', '<=', now()->format('Y-m-d'))
			->where('end_date', '>=', now()->format('Y-m-d'))->select('id', 'title', 'summary')->get();

		$ticket_count = SupportTicket::where('ticket_status', 'open')->count();
---
select `id`, `title`, `summary` from `announcements` where `start_date` <= '2024-08-18' and `end_date` >= '2024-08-18'
select count(*) as aggregate from `support_tickets` where `ticket_status` = 'open'